weight = int(input("Введите вес в кг"))
hight = float(input("Введите рост в метрах"))
IMT = weight / hight**2
if IMT < 16:
    print("Выраженный дефицит массы тела")
elif 16 <= IMT <= 18.49:
    print("Недостаточная масса тела")
elif 18.5 <= IMT <= 24.99:
    print("Норма")
elif 25 <= IMT <= 29.99:
    print("Избыточная масса тела")
elif 30 <= IMT <= 34.99:
    print("Ожирение 2 степени степени")
elif 35 <= IMT <= 39.99:
    print("Ожирение второй степени")
elif a >= 40:
    print("Ожирение третьей степени")