name = input('Здравствуйте, как вас зовут?')
print('Очень приятно, ' + name + '! Меня зовут Марк.')
age = int(input('Сколько Вам лет?'))
if age < 82:
    print('Да,',name, ', я старше Вас на ', 82 - age, 'лет')
else:
    print('Да,', name, ', Вы старше меня на ', age - 82, 'лет')
answer = input('Вам нравится програмировать?')
if answer == 'да':
    print('Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ.')
else:
    print('Жаль. Я думал, Вы сможете написать интересную программу для меня.')