a1 = input("Собака короткошерстной породы?").lower()
if a1 == "да":
    a2 = input("Рост собаки менее 50 см?").lower()
    if a2 == "да":
        a3 = input("У собаки короткий хвост?").lower()
        if a3 == "да":
            print("Английский бульдог")
        else:
            a3_0 = input("У собаки длинные уши?").lower()
            if a3_0 == "да":
                print("Гончая")
            else:
                a3_20 = input("У собаки короткое тело?").lower()
                if a3_20 == "да":
                    print("Мопс")
                else:
                    print("Чихуахуа")
    else:
        a2_0 = input("Собака весит более 50 кг?").lower()
        if a2_0 == "да":
            print("Датский дог")
        else:
            print("Фоксхаунд")
else:
    a1_0 = input("Рост собаки менее 50см?").lower()
    if a1_0 == "да":
        a1_01 = input("У собаки доброжелательный характер?").lower()
        if a1_01 == "да":
            print("Коккер спаниэль")
        else:
            print("Ирландский сеттер")
    else:
        a1_00 = input("У собаки рост менее 70см?").lower()
        if a1_00 == "да":
            a1_001 = input("У собаки длинные уши?").lower()
            if a1_001 == "да":
                print("Большой вандейский грифон")
            else:
                print("Колли")
        else:
            a1_000 = input("Окрас рыжий с белыми отметинами?").lower()
            if a1_000 == "да":
                print("Сенбернар")
            else:
                a1_0000 = input("Белоснежный окрас?").lower()
                if a1_0000 == "да":
                    print("Ирландский волкодав")
                else:
                    print("Ньюфаундленд")